In [2]:
import pandas as pd

In [3]:
pd.read_csv('employees.csv')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [4]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-03-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-03-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-03-03 11:17:00,130590,11.858,False,Finance

In [7]:
df[df['Gender'] == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-03-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-03-03 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-03-03 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-03-03 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-03-03 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-03-03 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-03-03 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-03-03 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-03-03 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-03-03 18:24:00,129949,10.169,True,Sales

In [12]:
condition = df['Team'] == 'Finance'
df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-03-03 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-03-03 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2022-03-03 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2022-03-03 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2022-03-03 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2022-03-03 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2022-03-03 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2022-03-03 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2022-03-03 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2022-03-03 06:30:00,42392,19.675,False,Finance

In [13]:
df[df['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-03-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-03-03 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-03-03 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-03-03 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2022-03-03 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2022-03-03 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-03-03 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-03-03 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-03-03 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2022-03-03 18:24:00,129949,10.169,True,Sales

In [17]:
df[df["Team"] != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-03-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-03-03 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-03-03 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-03-03 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-03-03 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-03-03 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-03-03 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-03-03 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-03-03 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-03-03 18:24:00,129949,10.169,True,Sales

In [20]:
df[df['Salary'] > 110000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-03-03 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-03-03 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2022-03-03 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2022-03-03 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2022-03-03 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2022-03-03 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2022-03-03 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-03-03 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2022-03-03 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2022-03-03 18:24:00,129949,10.169,True,Sales

In [22]:
df[df['Bonus %'] < 1.5]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2022-03-03 16:47:00,101004,1.389,True,Client Services
15,Lillian,Female,2016-06-05,2022-03-03 06:09:00,59414,1.256,False,Product
58,Theresa,Female,2010-04-11,2022-03-03 07:18:00,72670,1.481,True,Engineering
77,Charles,Male,2004-09-14,2022-03-03 20:13:00,107391,1.260,True,Marketing
175,Willie,Male,1998-02-17,2022-03-03 20:20:00,146651,1.451,True,Engineering
189,Clarence,Male,1998-05-02,2022-03-03 03:16:00,85700,1.215,False,Sales
217,Douglas,Male,1999-09-03,2022-03-03 16:00:00,83341,1.015,True,Client Services
273,Nicholas,Male,1994-04-12,2022-03-03 20:21:00,74669,1.113,True,Product
279,Ruby,Female,2000-11-08,2022-03-03 19:35:00,105946,1.139,False,Business Development
365,Gloria,NaN,1983-07-19,2022-03-03 01:57:00,140885,1.113,False,Human Resources
445,Chris,Male,2006-12-12,2022-03-03 01:57:00,71642,1.496,False,NaN
481,NaN,Female,2013-04-27,2022-03-03 06:40:00,93847,1.085,True,Business Development
527,Helen,NaN,1993-12-02,2022-03-03 13:42:00,45724,1.022,False,Product
570,Kelly,Female,1996-08-16,2022-03-03 03:09:00,41427,1.431,False,Product
578,Amanda,Female,1982-03-17,2022-03-03 23:46:00,107111,1.438,True,Product
579,Harold,Male,2010-10-18,2022-03-03 20:45:00,65673,1.187,True,Legal
617,Kathy,Female,2001-01-14,2022-03-03 05:11:00,45682,1.451,True,Marketing
618,Peter,Male,1992-11-24,2022-03-03 17:43:00,69297,1.268,False,Finance
638,Frances,Female,1996-11-12,2022-03-03 18:08:00,112467,1.433,False,Business Development
652,Willie,Male,2009-12-05,2022-03-03 05:39:00,141932,1.017,True,Engineering
708,Steve,Male,2002-01-11,2022-03-03 21:17:00,51821,1.197,True,Legal
732,Henry,Male,1986-05-12,2022-03-03 02:04:00,59943,1.432,False,Finance
734,NaN,Female,1994-12-18,2022-03-03 20:42:00,138807,1.400,True,Human Resources
746,Gloria,Female,2004-08-19,2022-03-03 10:31:00,46602,1.027,True,Business Development
912,Joe,Male,1998-12-08,2022-03-03 10:28:00,126120,1.020,False,NaN
929,Theresa,Female,2001-04-27,2022-03-03 21:17:00,75661,1.079,True,Legal
954,Joe,Male,1980-01-19,2022-03-03 16:06:00,119667,1.148,True,Finance
997,Russell,Male,2013-05-20,2022-03-03 12:39:00,96914,1.421,False,Product

In [25]:
df[df['Start Date'] <= '1985-01-01']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2022-03-03 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2022-03-03 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2022-03-03 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2022-03-03 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2022-03-03 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2022-03-03 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2022-03-03 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2022-03-03 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2022-03-03 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2022-03-03 06:30:00,42392,19.675,False,Finance